_posts/2014-09-29-aosp.html
---
layout: post
title: AOSP
description: AOSP
---
<style type="text/css">
 <!--/*--><![CDATA[/*><!--*/
  html { font-family: Times, serif; font-size: 12pt; }
  .title  { text-align: center; }
  .todo   { color: red; }
  .done   { color: green; }
  .tag    { background-color: #add8e6; font-weight:normal }
  .target { }
  .timestamp { color: #bebebe; }
  .timestamp-kwd { color: #5f9ea0; }
  .right  {margin-left:auto; margin-right:0px;  text-align:right;}
  .left   {margin-left:0px;  margin-right:auto; text-align:left;}
  .center {margin-left:auto; margin-right:auto; text-align:center;}
  p.verse { margin-left: 3% }
  pre {
	border: 1pt solid #AEBDCC;
	background-color: #F3F5F7;
	padding: 5pt;
	font-family: courier, monospace;
        font-size: 90%;
        overflow:auto;
  }
  table { border-collapse: collapse; }
  td, th { vertical-align: top;  }
  th.right  { text-align:center;  }
  th.left   { text-align:center;   }
  th.center { text-align:center; }
  td.right  { text-align:right;  }
  td.left   { text-align:left;   }
  td.center { text-align:center; }
  dt { font-weight: bold; }
  div.figure { padding: 0.5em; }
  div.figure p { text-align: center; }
  div.inlinetask {
    padding:10px;
    border:2px solid gray;
    margin:10px;
    background: #ffffcc;
  }
  textarea { overflow-x: auto; }
  .linenr { font-size:smaller }
  .code-highlighted {background-color:#ffff00;}
  .org-info-js_info-navigation { border-style:none; }
  #org-info-js_console-label { font-size:10px; font-weight:bold;
                               white-space:nowrap; }
  .org-info-js_search-highlight {background-color:#ffff00; color:#000000;
                                 font-weight:bold; }
  /*]]>*/-->
</style>
<script type="text/javascript">
/*
@licstart  The following is the entire license notice for the
JavaScript code in this tag.

Copyright (C) 2012-2013 Free Software Foundation, Inc.

The JavaScript code in this tag is free software: you can
redistribute it and/or modify it under the terms of the GNU
General Public License (GNU GPL) as published by the Free Software
Foundation, either version 3 of the License, or (at your option)
any later version.  The code is distributed WITHOUT ANY WARRANTY;
without even the implied warranty of MERCHANTABILITY or FITNESS
FOR A PARTICULAR PURPOSE.  See the GNU GPL for more details.

As additional permission under GNU GPL version 3 section 7, you
may distribute non-source (e.g., minimized or compacted) forms of
that code without the copy of the GNU GPL normally required by
section 4, provided you include this license notice and a URL
through which recipients can access the Corresponding Source.


@licend  The above is the entire license notice
for the JavaScript code in this tag.
*/
<!--/*--><![CDATA[/*><!--*/
 function CodeHighlightOn(elem, id)
 {
   var target = document.getElementById(id);
   if(null != target) {
     elem.cacheClassElem = elem.className;
     elem.cacheClassTarget = target.className;
     target.className = "code-highlighted";
     elem.className   = "code-highlighted";
   }
 }
 function CodeHighlightOff(elem, id)
 {
   var target = document.getElementById(id);
   if(elem.cacheClassElem)
     elem.className = elem.cacheClassElem;
   if(elem.cacheClassTarget)
     target.className = elem.cacheClassTarget;
 }
/*]]>*///-->
</script>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">AOSP</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 下载与构建Android源码</a></li>
<li><a href="#sec-2">2 安装Build环境</a>
<ul>
<li><a href="#sec-2-1">2.1 选择一个分支</a></li>
<li><a href="#sec-2-2">2.2 装配一个Linux build环境</a>
<ul>
<li><a href="#sec-2-2-1">2.2.1 安装JDK</a></li>
<li><a href="#sec-2-2-2">2.2.2 安装需要的包（Ubuntu 12.04）</a></li>
<li><a href="#sec-2-2-3">2.2.3 配置USB访问</a></li>
<li><a href="#sec-2-2-4">2.2.4 配置ccache</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-3">3 下载源码</a>
<ul>
<li><a href="#sec-3-1">3.1 安装repo</a></li>
<li><a href="#sec-3-2">3.2 初始化Repo客户端</a></li>
<li><a href="#sec-3-3">3.3 下载源码</a></li>
</ul>
</li>
<li><a href="#sec-4">4 Build</a>
<ul>
<li><a href="#sec-4-1">4.1 初始化</a></li>
<li><a href="#sec-4-2">4.2 选择一个目标（Choose a Target）</a></li>
<li><a href="#sec-4-3">4.3 Build the Code</a></li>
<li><a href="#sec-4-4">4.4 Run It!</a>
<ul>
<li><a href="#sec-4-4-1">4.4.1 Flash a Device（应该就是说-刷机）</a></li>
<li><a href="#sec-4-4-2">4.4.2 启动模拟器</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 下载与构建Android源码</h2>
<div class="outline-text-2" id="text-1">

<p>  在开始之前，先确定你系统满足下列要求：
</p><ul>
<li>一个Linux或Mac系统
</li>
<li>对于Gingerbread（2.3.x）以及以上版本需要64-bit环境
</li>
<li>一个单个的构建需要30G，如果全版本构建需要100G或更多。源码下载约8.5G
</li>
<li>Python 2.6 &ndash; 2.7
</li>
<li>GNU Make 3.81 &ndash; 3.82
</li>
<li>JDK 7 to master brancd;JDK 6 用来构建Gingerbread（2.3.x） &ndash; KitKat（4.4.x）;JDK 5 用来构建Cupcake &ndash; Froyo
</li>
<li>Git 1.7 或者更新
</li>
</ul>


</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 安装Build环境</h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 选择一个分支</h3>
<div class="outline-text-3" id="text-2-1">

<p>   因为分支间build环境会有差异，所以你选择一个分支，也就选择了build环境
</p></div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> 装配一个Linux build环境</h3>
<div class="outline-text-3" id="text-2-2">

<p>   在内部，Android build常规测试是在最近的Ubuntu LTS（12.04）上。
</p>
</div>

<div id="outline-container-2-2-1" class="outline-4">
<h4 id="sec-2-2-1"><span class="section-number-4">2.2.1</span> 安装JDK</h4>
<div class="outline-text-4" id="text-2-2-1">

<p>     master branch需要Java 7,在Ubuntu上用OpenJDK。
</p>


<pre class="src src-sh">$ sudo apt-get update
$ sudo apt-get install openjdk-7-jdk
</pre>


</div>

</div>

<div id="outline-container-2-2-2" class="outline-4">
<h4 id="sec-2-2-2"><span class="section-number-4">2.2.2</span> 安装需要的包（Ubuntu 12.04）</h4>
<div class="outline-text-4" id="text-2-2-2">

<p>     你需要64-bit版本的Ubuntu，建议12.04.
</p>


<pre class="src src-sh">$ sudo apt-get install git gnupg flex bison gperf build-essential <span style="color: #8b2252;">\</span>
  zip curl libc6-dev libncurses5-dev:i386 x11proto-core-dev <span style="color: #8b2252;">\</span>
  libx11-dev:i386 libreadline6-dev:i386 libgl1-mesa-glx:i386 <span style="color: #8b2252;">\</span>
  libgl1-mesa-dev g++-multilib mingw32 tofrodos <span style="color: #8b2252;">\</span>
  python-markdown libxml2-utils xsltproc zlib1g-dev:i386
$ sudo ln -s /usr/lib/i386-linux-gnu/mesa/libGL.so.1 /usr/lib/i386-linux-gnu/libGL.so
</pre>


</div>

</div>

<div id="outline-container-2-2-3" class="outline-4">
<h4 id="sec-2-2-3"><span class="section-number-4">2.2.3</span> 配置USB访问</h4>
<div class="outline-text-4" id="text-2-2-3">

<p>     在GNU/linux系统下，默认普通用户是不能直接访问USB的，所以要配置。建议创建/etc/udev/rules.d/51-android.rules (as the root user)，并复制下面到文件中，&lt;username&gt;替换成你的
</p>


<pre class="example"># adb protocol on passion (Nexus One)
SUBSYSTEM=="usb", ATTR{idVendor}=="18d1", ATTR{idProduct}=="4e12", MODE="0600", OWNER="&lt;username&gt;"
# fastboot protocol on passion (Nexus One)
SUBSYSTEM=="usb", ATTR{idVendor}=="0bb4", ATTR{idProduct}=="0fff", MODE="0600", OWNER="&lt;username&gt;"
# adb protocol on crespo/crespo4g (Nexus S)
SUBSYSTEM=="usb", ATTR{idVendor}=="18d1", ATTR{idProduct}=="4e22", MODE="0600", OWNER="&lt;username&gt;"
# fastboot protocol on crespo/crespo4g (Nexus S)
SUBSYSTEM=="usb", ATTR{idVendor}=="18d1", ATTR{idProduct}=="4e20", MODE="0600", OWNER="&lt;username&gt;"
# adb protocol on stingray/wingray (Xoom)
SUBSYSTEM=="usb", ATTR{idVendor}=="22b8", ATTR{idProduct}=="70a9", MODE="0600", OWNER="&lt;username&gt;"
# fastboot protocol on stingray/wingray (Xoom)
SUBSYSTEM=="usb", ATTR{idVendor}=="18d1", ATTR{idProduct}=="708c", MODE="0600", OWNER="&lt;username&gt;"
# adb protocol on maguro/toro (Galaxy Nexus)
SUBSYSTEM=="usb", ATTR{idVendor}=="04e8", ATTR{idProduct}=="6860", MODE="0600", OWNER="&lt;username&gt;"
# fastboot protocol on maguro/toro (Galaxy Nexus)
SUBSYSTEM=="usb", ATTR{idVendor}=="18d1", ATTR{idProduct}=="4e30", MODE="0600", OWNER="&lt;username&gt;"
# adb protocol on panda (PandaBoard)
SUBSYSTEM=="usb", ATTR{idVendor}=="0451", ATTR{idProduct}=="d101", MODE="0600", OWNER="&lt;username&gt;"
# adb protocol on panda (PandaBoard ES)
SUBSYSTEM=="usb", ATTR{idVendor}=="18d1", ATTR{idProduct}=="d002", MODE="0600", OWNER="&lt;username&gt;"
# fastboot protocol on panda (PandaBoard)
SUBSYSTEM=="usb", ATTR{idVendor}=="0451", ATTR{idProduct}=="d022", MODE="0600", OWNER="&lt;username&gt;"
# usbboot protocol on panda (PandaBoard)
SUBSYSTEM=="usb", ATTR{idVendor}=="0451", ATTR{idProduct}=="d00f", MODE="0600", OWNER="&lt;username&gt;"
# usbboot protocol on panda (PandaBoard ES)
SUBSYSTEM=="usb", ATTR{idVendor}=="0451", ATTR{idProduct}=="d010", MODE="0600", OWNER="&lt;username&gt;"
# adb protocol on grouper/tilapia (Nexus 7)
SUBSYSTEM=="usb", ATTR{idVendor}=="18d1", ATTR{idProduct}=="4e42", MODE="0600", OWNER="&lt;username&gt;"
# fastboot protocol on grouper/tilapia (Nexus 7)
SUBSYSTEM=="usb", ATTR{idVendor}=="18d1", ATTR{idProduct}=="4e40", MODE="0600", OWNER="&lt;username&gt;"
# adb protocol on manta (Nexus 10)
SUBSYSTEM=="usb", ATTR{idVendor}=="18d1", ATTR{idProduct}=="4ee2", MODE="0600", OWNER="&lt;username&gt;"
# fastboot protocol on manta (Nexus 10)
SUBSYSTEM=="usb", ATTR{idVendor}=="18d1", ATTR{idProduct}=="4ee0", MODE="0600", OWNER="&lt;username&gt;"
</pre>


</div>

</div>

<div id="outline-container-2-2-4" class="outline-4">
<h4 id="sec-2-2-4"><span class="section-number-4">2.2.4</span> 配置ccache</h4>
<div class="outline-text-4" id="text-2-2-4">

<p>     你可以在build的时候使用ccache编译工具，Ccache作为一个编译缓存能够在rebuild的时候提高速度。如果你经常执行“make clean”，或者经常切换于不同的build产品
在~/.bashrc中加上
</p>


<pre class="src src-sh"><span style="color: #483d8b;">export</span> <span style="color: #a0522d;">USE_CCACHE</span>=1
</pre>

<p>
默认缓存被存储在~/.ccache，也可以在~/.bashrc中指定目录：
</p>


<pre class="src src-sh"><span style="color: #483d8b;">export</span> <span style="color: #a0522d;">CCACHE_DIR</span>=&lt;path-to-your-cache-directory&gt;
</pre>

<p>
建议cache大小是50-100G。在下载完源代码后运行下列命令
</p>


<pre class="src src-sh">prebuilts/misc/linux-x86/ccache/ccache -M 50G
</pre>



</div>
</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 下载源码</h2>
<div class="outline-text-2" id="text-3">


</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> 安装repo</h3>
<div class="outline-text-3" id="text-3-1">

<p>    repo是一个使用Git工作更加容易操作的工具
安装Repo：
</p><ol>
<li>在你的主目录建立一个bin/ 



<pre class="src src-sh">$ mkdir ~/bin
$ <span style="color: #a0522d;">PATH</span>=~/bin:$<span style="color: #a0522d;">PATH</span>
</pre>

</li>
<li>下载Repo，给它执行权限



<pre class="src src-sh">$ curl https://storage.googleapis.com/git-repo-downloads/repo &gt; ~/bin/repo
$ chmod a+x ~/bin/repo
</pre>

</li>
</ol>


</div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> 初始化Repo客户端</h3>
<div class="outline-text-3" id="text-3-2">

<ol>
<li>创建一个目录，名称任意



<pre class="src src-sh">$ mkdir WORKING_DIRECTORY
$ cd WORKING_DIRECTORY
</pre>

</li>
<li>运行repo init，指定manifest的URL，下载主分支



<pre class="src src-sh">$ repo init -u https://android.googlesource.com/platform/manifest
</pre>

</li>
</ol>

<p>也可以下载其他分支
</p>


<pre class="src src-sh">$ repo init -u https://android.googlesource.com/platform/manifest -b android-4.0.1_r1
</pre>


</div>

</div>

<div id="outline-container-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> 下载源码</h3>
<div class="outline-text-3" id="text-3-3">




<pre class="src src-sh">$ repo sync
</pre>



</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Build</h2>
<div class="outline-text-2" id="text-4">


</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> 初始化</h3>
<div class="outline-text-3" id="text-4-1">

<p>先用envsetup.sh初始化环境
</p>


<pre class="src src-sh">$ source build/envsetup.sh
</pre>

<p>
or
</p>


<pre class="src src-sh">$ . build/envsetup.sh
</pre>

</div>

</div>

<div id="outline-container-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> 选择一个目标（Choose a Target）</h3>
<div class="outline-text-3" id="text-4-2">

<p>用lunch选择构建那个目标，如：
</p>


<pre class="src src-sh">$ lunch aosp_arm-eng
</pre>

<p>
如果你输入lunch不加参数，它会提示你选择target
target形式：BUILD-BUILDTYPE。
BUILD一部分如下：
</p><table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Build name</th><th scope="col" class="left">Device</th><th scope="col" class="left">Notes</th></tr>
</thead>
<tbody>
<tr><td class="left">aosp_arm</td><td class="left">ARM emulator</td><td class="left">AOSP, fully configured with all languages, apps, input method</td></tr>
<tr><td class="left">aosp_maguro</td><td class="left">maguro</td><td class="left">AOSP, running on Galaxy Nexus GSM/HSPA+ ("maguro")</td></tr>
<tr><td class="left">aosp_panda</td><td class="left">panda</td><td class="left">AOSP, running on PandaBoard ("panda")</td></tr>
</tbody>
</table>


<p>
BUILDTYPE下列其中之一：
</p><table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Buildtype</th><th scope="col" class="left">Use</th></tr>
</thead>
<tbody>
<tr><td class="left">user</td><td class="left">limited access; suited for production</td></tr>
<tr><td class="left">userdebug</td><td class="left">like "user" but with root access and debuggability; preferred for debugging</td></tr>
<tr><td class="left">eng</td><td class="left">development configuration with additional debugging tools</td></tr>
</tbody>
</table>

当你在命令行下输入lunch aosp然后按两下TAB键，会有很多提示。
当我运行 lunch aosp_arm64-eng时，编译会出错，而运行lunch aosp_arm-eng之后编译就可以通过

</div>

</div>

<div id="outline-container-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> Build the Code</h3>
<div class="outline-text-3" id="text-4-3">

<p>终于到build的时候了，别激动。这时候就用到了make，GNU make通过设置 -jN参数来支持并行编译，通常N设置为hardware threads的1到2倍。
例如：dual-E5520，配置为两个CPU，每个CPU为4核，每核两个线程。最快的build命令为 make -j16 至  make -j32。
我的机器为i5-3470，4核，所以我运行
</p>


<pre class="src src-sh">$ make -j8
</pre>


</div>

</div>

<div id="outline-container-4-4" class="outline-3">
<h3 id="sec-4-4"><span class="section-number-3">4.4</span> Run It!</h3>
<div class="outline-text-3" id="text-4-4">


</div>

<div id="outline-container-4-4-1" class="outline-4">
<h4 id="sec-4-4-1"><span class="section-number-4">4.4.1</span> Flash a Device（应该就是说-刷机）</h4>
<div class="outline-text-4" id="text-4-4-1">

<p>首先让设备进入fastboot模式，可以手动，也可以在shell中输入
</p>


<pre class="src src-sh">$ adb reboot bootloader
</pre>

<p>
设备进入fastboot模式后，运行：
</p>


<pre class="src src-sh">$ fastboot flashall -w
</pre>

<p>
-w选项会擦除设备上的/data分区，这在你设备第一次刷时很有用，其他情况则可以不加-w
</p></div>

</div>

<div id="outline-container-4-4-2" class="outline-4">
<h4 id="sec-4-4-2"><span class="section-number-4">4.4.2</span> 启动模拟器</h4>
<div class="outline-text-4" id="text-4-4-2">

<p>emulator会在build过程中加入到你的path中，运行
</p>


<pre class="src src-sh">$ emulator
</pre>

<p>
很不幸，类似提示  cache partition was configured to be ext4 （expect yaffs2）
最后运行
</p>


<pre class="src src-sh">$ . build/envsetup.sh
$ lunch sdk-eng
$ make sdk
$ emulator
</pre>

<p>
ok！不过后来我重新编译后，把out/target/product/generic/cache.img 删除也是可以启动的
</p>
<p>
还有一个问题，当你退出当前环境，下次进入时就会遇到很多启动emulator困难，如：emulator找不到、img找不到
网上说可以指定img运行，emulator -system out/&hellip;./system.img -data out/&hellip;./userdata.img -ramdisk out/&hellip;./ramdisk.img
但是今天我运行就报错，还要配置什么环境变量。。。
也可以按照<a href="https://source.android.com/source/using-eclipse.html#debugging-the-emulator-with-eclipse">官网</a> 上说的做，几分钟就ok了，删除cache.img，然后运行emulator
</p></div>
</div>
</div>
</div>
</div>
